In [1]:
import pandas as pd

In [6]:
df = pd.read_csv("employees.csv")
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [14]:
df["Start Date"] = pd.to_datetime(df["Start Date"])

In [11]:
dft

0     1993-08-06
1     1996-03-31
2     1993-04-23
3     2005-03-04
4     1998-01-24
         ...
995   2014-11-23
996   1984-01-31
997   2013-05-20
998   2013-04-20
999   2012-05-15
Name: Start Date, Length: 1000, dtype: datetime64[ns]

In [15]:
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,11:17 AM,130590,11.858,False,Finance

In [17]:
df["Last Login Time"] = pd.to_datetime(df["Last Login Time"])

In [18]:
df["Last Login Time"]

0     2022-01-21 12:42:00
1     2022-01-21 06:53:00
2     2022-01-21 11:17:00
3     2022-01-21 13:00:00
4     2022-01-21 16:47:00
              ...
995   2022-01-21 06:09:00
996   2022-01-21 06:30:00
997   2022-01-21 12:39:00
998   2022-01-21 16:45:00
999   2022-01-21 18:24:00
Name: Last Login Time, Length: 1000, dtype: datetime64[ns]

In [20]:
df["Senior Management"].astype("bool")

0       True
1       True
2      False
3       True
4       True
       ...
995    False
996    False
997    False
998    False
999     True
Name: Senior Management, Length: 1000, dtype: bool

In [21]:
df["Gender"].astype("category")

0        Male
1        Male
2      Female
3        Male
4        Male
        ...
995       NaN
996      Male
997      Male
998      Male
999      Male
Name: Gender, Length: 1000, dtype: category
Categories (2, object): ['Female', 'Male']

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: datetime64[ns](2), float64(1), int64(1), object(4)
memory usage: 62.6+ KB

In [31]:
df = pd.read_csv("employees.csv", parse_dates=["Start Date","Last Login Time"])
df.head(3)
df["Gender"] = df["Gender"].astype("category")

In [33]:
df["Gender"] == "Male"

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: Gender, Length: 1000, dtype: bool

In [34]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-01-21 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-01-21 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2022-01-21 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-01-21 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-01-21 16:47:00,101004,1.389,True,Client Services

In [36]:
df[df["Team"] == "Finance"]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2022-01-21 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-01-21 13:00:00,138705,9.340,True,Finance
7,NaN,Female,2015-07-20,2022-01-21 10:43:00,45906,11.598,NaN,Finance
14,Kimberly,Female,1999-01-14,2022-01-21 07:13:00,41426,14.543,True,Finance
46,Bruce,Male,2009-11-28,2022-01-21 22:47:00,114796,6.796,False,Finance
...,...,...,...,...,...,...,...,...
907,Elizabeth,Female,1998-07-27,2022-01-21 11:12:00,137144,10.081,False,Finance
954,Joe,Male,1980-01-19,2022-01-21 16:06:00,119667,1.148,True,Finance
987,Gloria,Female,2014-12-08,2022-01-21 05:08:00,136709,10.331,True,Finance
992,Anthony,Male,2011-10-16,2022-01-21 08:35:00,112769,11.625,True,Finance
996,Phillip,Male,1984-01-31,2022-01-21 06:30:00,42392,19.675,False,Finance

In [39]:
df[df["Salary"] > 1100000]

Empty DataFrame
Columns: [First Name, Gender, Start Date, Last Login Time, Salary, Bonus %, Senior Management, Team]
Index: []

In [40]:
df[df["Salary"] > 11000]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-01-21 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-01-21 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2022-01-21 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-01-21 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-01-21 16:47:00,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,2014-11-23,2022-01-21 06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,2022-01-21 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2022-01-21 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2022-01-21 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2022-01-21 18:24:00,129949,10.169,True,Sales

In [49]:
df = pd.read_csv("employees.csv", parse_dates=["Start Date","Last Login Time"])
df["Gender"] = df["Gender"].astype("category")
df["Team"] = df["Team"].astype("category")
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-01-22 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-01-22 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2022-01-22 11:17:00,130590,11.858,False,Finance

In [53]:
mask1 = df["Gender"] == "Male"
mask2 = df["Team"] == "Marketing"
df["mask1" & "mask2"]

TypeError: unsupported operand type(s) for &: 'str' and 'str'

In [51]:
df["Team"].dtype

CategoricalDtype(categories=['Business Development', 'Client Services', 'Distribution',
                  'Engineering', 'Finance', 'Human Resources', 'Legal',
                  'Marketing', 'Product', 'Sales'],
, ordered=False)

In [55]:
mask1 = df["Senior Management"] 
mask2 = df["Start Date"] < "1990-01-01"
df[mask1 | mask2]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-01-22 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-01-22 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2022-01-22 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-01-22 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2022-01-22 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
992,Anthony,Male,2011-10-16,2022-01-22 08:35:00,112769,11.625,True,Finance
993,Tina,Female,1997-05-15,2022-01-22 15:53:00,56450,19.040,True,Engineering
994,George,Male,2013-06-21,2022-01-22 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2022-01-22 06:30:00,42392,19.675,False,Finance
999,Albert,Male,2012-05-15,2022-01-22 18:24:00,129949,10.169,True,Sales

In [58]:
mask1 = df["Team"] == "Legal"
mask2 = df["Team"] == "Sales"
mask3 = df["Team"] == "Product"

df[mask1 | mask2 |mask3]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
5,Dennis,Male,1987-04-18,2022-01-22 01:35:00,115163,10.125,False,Legal
6,Ruby,Female,1987-08-17,2022-01-22 16:20:00,65476,10.012,True,Product
11,Julie,Female,1997-10-26,2022-01-22 15:19:00,102508,12.637,True,Legal
13,Gary,Male,2008-01-27,2022-01-22 23:40:00,109831,5.831,False,Sales
15,Lillian,Female,2016-06-05,2022-01-22 06:09:00,59414,1.256,False,Product
...,...,...,...,...,...,...,...,...
981,James,Male,1993-01-15,2022-01-22 17:19:00,148985,19.280,False,Legal
985,Stephen,NaN,1983-07-10,2022-01-22 20:10:00,85668,1.909,False,Legal
989,Justin,NaN,1991-02-10,2022-01-22 16:58:00,38344,3.794,False,Legal
997,Russell,Male,2013-05-20,2022-01-22 12:39:00,96914,1.421,False,Product
999,Albert,Male,2012-05-15,2022-01-22 18:24:00,129949,10.169,True,Sales

In [61]:
mask3= df["Team"].isin(["Legal","Sales","Product"])
mask3

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997     True
998    False
999     True
Name: Team, Length: 1000, dtype: bool

In [63]:
mask = df["Team"].isnull()
df[mask]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2022-01-22 06:53:00,61933,4.170,True,NaN
10,Louise,Female,1980-08-12,2022-01-22 09:01:00,63241,15.132,True,NaN
23,NaN,Male,2012-06-14,2022-01-22 16:19:00,125792,5.042,NaN,NaN
32,NaN,Male,1998-08-21,2022-01-22 14:27:00,122340,6.417,NaN,NaN
91,James,NaN,2005-01-26,2022-01-22 23:00:00,128771,8.309,False,NaN
109,Christopher,Male,2000-04-22,2022-01-22 10:15:00,37919,11.449,False,NaN
139,NaN,Female,1990-10-03,2022-01-22 01:08:00,132373,10.527,NaN,NaN
199,Jonathan,Male,2009-07-17,2022-01-22 08:15:00,130581,16.736,True,NaN
258,Michael,Male,2002-01-24,2022-01-22 03:04:00,43586,12.659,False,NaN
290,Jeremy,Male,1988-06-14,2022-01-22 18:20:00,129460,13.657,True,NaN
314,Bobby,Male,1996-03-31,2022-01-22 17:40:00,112117,6.338,False,NaN
367,Edward,Male,1989-08-04,2022-01-22 06:06:00,66067,10.957,True,NaN
382,NaN,Female,1996-04-18,2022-01-22 15:57:00,107024,12.182,NaN,NaN
434,Joyce,Female,1995-02-07,2022-01-22 07:38:00,50701,14.227,True,NaN
438,Jason,Male,1998-11-20,2022-01-22 14:54:00,69244,6.220,True,NaN
445,Chris,Male,2006-12-12,2022-01-22 01:57:00,71642,1.496,False,NaN
479,Richard,Male,1997-07-04,2022-01-22 11:47:00,47647,18.787,True,NaN
512,Wanda,Female,1993-04-06,2022-01-22 03:11:00,78883,19.695,False,NaN
513,Jimmy,Male,2013-11-19,2022-01-22 19:29:00,63549,19.624,False,NaN
520,Peter,Male,2003-02-22,2022-01-22 09:09:00,56580,8.411,True,NaN
567,NaN,Female,1980-04-01,2022-01-22 20:04:00,48141,12.605,NaN,NaN
573,Kimberly,Female,1981-12-30,2022-01-22 04:51:00,81800,5.435,True,NaN
580,Harry,Male,1985-01-27,2022-01-22 20:18:00,65482,18.089,False,NaN
626,NaN,Female,1997-04-13,2022-01-22 08:03:00,131755,2.930,NaN,NaN
634,Carl,Male,1987-03-30,2022-01-22 17:59:00,75598,19.289,False,NaN
635,Randy,Male,2000-09-27,2022-01-22 03:04:00,89831,13.047,True,NaN
647,Donald,Male,1988-04-06,2022-01-22 10:00:00,122920,5.320,False,NaN
669,Joseph,NaN,1982-03-28,2022-01-22 13:05:00,86564,11.879,True,NaN
684,Alice,Female,2016-01-21,2022-01-22 17:07:00,117787,10.485,False,NaN
706,Todd,Male,1993-07-04,2022-01-22 18:53:00,128175,18.473,True,NaN
726,Daniel,Male,2016-02-29,2022-01-22 04:04:00,77287,13.000,True,NaN
753,Antonio,Male,1999-06-06,2022-01-22 22:54:00,41928,5.478,True,NaN
774,NaN,Female,2000-06-18,2022-01-22 07:36:00,106428,10.867,NaN,NaN
781,Lawrence,Male,1995-07-03,2022-01-22 22:55:00,46378,9.127,False,NaN
794,Nicole,Female,2004-03-01,2022-01-22 17:17:00,44021,10.286,False,NaN
826,NaN,NaN,1988-08-01,2022-01-22 01:35:00,87103,5.665,NaN,NaN
850,Charles,Male,1997-09-03,2022-01-22 10:04:00,148291,6.002,False,NaN
851,Bobby,Male,1996-08-19,2022-01-22 01:16:00,147842,16.158,True,NaN
853,Mildred,Female,2007-04-06,2022-01-22 22:06:00,139284,11.390,True,NaN
855,Phillip,NaN,2003-10-20,2022-01-22 11:09:00,89700,2.277,True,NaN
864,Ryan,Male,2012-11-16,2022-01-22 13:47:00,57292,6.010,False,NaN
912,Joe,Male,1998-12-08,2022-01-22 10:28:00,126120,1.020,False,NaN
951,NaN,Female,2010-09-14,2022-01-22 05:19:00,143638,9.662,NaN,NaN

In [64]:
df["Team"].notnull()

0       True
1      False
2       True
3       True
4       True
       ...
995     True
996     True
997     True
998     True
999     True
Name: Team, Length: 1000, dtype: bool

In [65]:
df[df["Salary"].between (60000,70000)]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2022-01-22 06:53:00,61933,4.170,True,NaN
6,Ruby,Female,1987-08-17,2022-01-22 16:20:00,65476,10.012,True,Product
10,Louise,Female,1980-08-12,2022-01-22 09:01:00,63241,15.132,True,NaN
20,Lois,NaN,1995-04-22,2022-01-22 19:18:00,64714,4.934,True,Legal
41,Christine,NaN,2015-06-28,2022-01-22 01:08:00,66582,11.308,True,Business Development
...,...,...,...,...,...,...,...,...
965,Catherine,Female,1989-09-25,2022-01-22 01:31:00,68164,18.393,False,Client Services
970,Alice,Female,1988-09-03,2022-01-22 20:54:00,63571,15.397,True,Product
974,Harry,Male,2011-08-30,2022-01-22 18:31:00,67656,16.455,True,Client Services
978,Sean,Male,1983-01-17,2022-01-22 14:23:00,66146,11.178,False,Human Resources
998,Larry,Male,2013-04-20,2022-01-22 16:45:00,60500,11.985,False,Business Development

In [66]:
df = pd.read_csv("employees.csv", parse_dates=["Start Date","Last Login Time"])
df.sort_values("First Name", inplace = True)
df["Gender"] = df["Gender"].astype("category")

In [69]:
df[df["First Name"].duplicated()]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
327,Aaron,Male,1994-01-29,2022-01-22 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2022-01-22 14:53:00,52119,11.343,True,Client Services
937,Aaron,NaN,1986-01-22,2022-01-22 19:39:00,63126,18.424,False,Client Services
141,Adam,Male,1990-12-24,2022-01-22 20:57:00,110194,14.727,True,Product
302,Adam,Male,2007-07-05,2022-01-22 11:59:00,71276,5.027,True,Human Resources
...,...,...,...,...,...,...,...,...
902,NaN,Male,2001-05-23,2022-01-22 19:52:00,103877,6.322,NaN,Distribution
925,NaN,Female,2000-08-23,2022-01-22 16:19:00,95866,19.388,NaN,Sales
946,NaN,Female,1985-09-15,2022-01-22 01:50:00,133472,16.941,NaN,Distribution
947,NaN,Male,2012-07-30,2022-01-22 15:07:00,107351,5.329,NaN,Marketing
951,NaN,Female,2010-09-14,2022-01-22 05:19:00,143638,9.662,NaN,NaN

In [72]:
df[df["First Name"].duplicated(keep = "last")]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2022-01-22 10:20:00,61602,11.849,True,Marketing
327,Aaron,Male,1994-01-29,2022-01-22 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2022-01-22 14:53:00,52119,11.343,True,Client Services
137,Adam,Male,2011-05-21,2022-01-22 01:45:00,95327,15.120,False,Distribution
141,Adam,Male,1990-12-24,2022-01-22 20:57:00,110194,14.727,True,Product
...,...,...,...,...,...,...,...,...
890,NaN,Male,2015-11-24,2022-01-22 03:11:00,145329,7.100,NaN,Finance
902,NaN,Male,2001-05-23,2022-01-22 19:52:00,103877,6.322,NaN,Distribution
925,NaN,Female,2000-08-23,2022-01-22 16:19:00,95866,19.388,NaN,Sales
946,NaN,Female,1985-09-15,2022-01-22 01:50:00,133472,16.941,NaN,Distribution
947,NaN,Male,2012-07-30,2022-01-22 15:07:00,107351,5.329,NaN,Marketing

In [ ]:
df = pd.read_csv("employees.csv", parse_dates=["Start Date","Last Login Time"])
df.sort_values("First Name", inplace = True)
df["Gender"] = df["Gender"].astype("category")

In [73]:
len(df)

1000

In [79]:
len(df.drop_duplicates(subset = "First Name", keep = "last"))

201

In [80]:
df.drop_duplicates(subset = "First Name", keep = "last")

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
937,Aaron,NaN,1986-01-22,2022-01-22 19:39:00,63126,18.424,False,Client Services
538,Adam,Male,2010-10-08,2022-01-22 21:53:00,45181,3.491,False,Human Resources
610,Alan,Male,2012-02-17,2022-01-22 00:26:00,41453,10.084,False,Product
959,Albert,Male,1992-09-19,2022-01-22 02:35:00,45094,5.850,True,Business Development
693,Alice,Female,1995-10-16,2022-01-22 21:19:00,92799,2.782,False,Sales
...,...,...,...,...,...,...,...,...
512,Wanda,Female,1993-04-06,2022-01-22 03:11:00,78883,19.695,False,NaN
637,Wayne,Male,2009-09-02,2022-01-22 01:37:00,126956,18.396,False,Human Resources
127,William,Male,2002-09-29,2022-01-22 16:09:00,66521,5.830,False,Human Resources
652,Willie,Male,2009-12-05,2022-01-22 05:39:00,141932,1.017,True,Engineering
951,NaN,Female,2010-09-14,2022-01-22 05:19:00,143638,9.662,NaN,NaN

In [81]:
df["Gender"].unique()

['Male', NaN, 'Female']
Categories (2, object): ['Male', 'Female']

In [82]:
len(df["Gender"].unique())

3